/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_score_arg.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eidaho <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/05 10:18:34 by eidaho            #+#    #+#             */
/*   Updated: 2020/02/05 10:18:41 by eidaho           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/ft_printf.h"

int     specificator(int i, char *str)
{
    int j;

    j = i + 1;
    // проверяем полученную строку на наличие спецификаторов и прогоняем ее на наличие специального символа
    while (help_specificator(str[j]) == 0 && str[j] != '\0')
    {
        if (str[j] == '%')
            return (0);
        j++;
    }
    if (str[j] != '\0')
        return (j);
    return (0);
}

int     ft_score_arg(char *str, va_list arg)
{
    int i;
    int j;
    char *ptr;

    i = 0;
    while (str[i])
    {
    //  проверяем строку на наличие специального символа и отправляем ее на обработку в функцию, которая проверяет наличие спецификаторов
        if (str[i] == '%' && (j = specificator(i, str)))
        {
            // копируем строки выделяя под них память малоком(+ 1 символ)
            ptr = ft_strsub(str, i, j);
            //добавляем специф символы(по кол-ву)
            i += (j - i + 1);
        }
    }
}

